---
kind: property
id: P:Autodesk.Revit.DB.IConnector.Shape
source: html/68a666d3-3e85-d597-f409-da056e7b2e2b.htm
---
# Autodesk.Revit.DB.IConnector.Shape Property

The shape of the connector.

## Syntax (C#)
```csharp
ConnectorProfileType Shape { get; }
```

## Remarks
This property is used to retrieve the shape of the connector.

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - Throw when this connector has no shape.